// RSSI测距算法参数
// 距离探测设备1m时的rssi值的绝对值，最佳范围在45-49之间。 rssi1m
var default_rssi1m = 50;
// 环境衰减因子，需要测试矫正，最佳范围在3.25-4.5之间 EAT
var default_EAT = 2.96;

// 信标（参考点）初始信息
var beacon = {
    "info" : [
        {
            "id" : "A4:C1:38:02:89:EB",
            "x" : 0,
            "y" : 0,
            "rssi1m" : 50,
            "EAT" : 2.96
        },
        {
            "id" : "A4:C1:38:AB:BD:50",
            "x" : 0.2,
            "y" : 0.2,
            "rssi1m" : 50,
            "EAT" : 2.96
        },
        {
            "id" : "A4:C1:38:4E:EB:D1",
            "x" : 0.5,
            "y" : 1,
            "rssi1m" : 50,
            "EAT" : 2.96
        }
        // ,
        // {
        //     "id" : "A8:0C:63:2B:EB:57",
        //     "x" : 6,
        //     "y" : 8
        // },
        // {
        //     "id" : "5C:78:F8:63:2F:FD",
        //     "x" : 6,
        //     "y" : 9
        // },
        // {
        //     "id" : "E9:6C:16:42:51:57",
        //     "x" : 6.2,
        //     "y" : 9
        // }
    ]
}